In [ ]:
Database Connection
There are the following steps to connect a python application to our database.

Import mysql.connector module
Create the connection object.
Create the cursor object
Execute the query
Creating the connection
To create a connection between the MySQL database and the python application, the connect() method of mysql.connector module is used.
Pass the database details like HostName, username, and the database password in the method call. The method returns the connection object.

The syntax to use the connect() is given below.
Connection-Object= mysql.connector.connect(host = <host-name> , user = <username> , passwd = <password> )

In [ ]:
Python commit() method
Python provides the commit() method which ensures the changes made to

the database consistently take place.

The syntax to use the commit() method is given below.


conn.commit() #conn is the connection object   
All the operations that modify the records of the database do not take place until the commit() is called.

Python rollback() method
The rollback() method is used to revert the changes that are done to the database. 
This method is useful in the sense that, if some error occurs during the database operations, 
we can rollback that transaction to maintain the database consistency.

The syntax to use the rollback() is given below.

Conn.rollback()  
    
Closing the connection
We need to close the database connection once we have done all the operations regarding the database. Python provides the close() method. 
The syntax to use the close() method is given below.
conn.close()

In [1]:
import mysql.connector
try:
    conn = mysql.connector.connect(
        host="localhost",
        user="root",  
        password="balaji"  
    )
    print("Connection successful:", conn)
    conn.close()
except mysql.connector.Error as err:
    print("Error:", err)

Error: 1045 (28000): Access denied for user 'root'@'localhost' (using password: YES)

In [2]:
import mysql.connector
try:
    connection=mysql.connector.connect(
        host='localhost',
        user='root',
        password='root')
    print("Connection successful:",connection)
    connection.close()
except mysql.connector.Error as err:
    print("Error:",err)

Error: 1045 (28000): Access denied for user 'root'@'localhost' (using password: YES)

In [3]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='root')
print(connection)

ProgrammingError: 1045 (28000): Access denied for user 'root'@'localhost' (using password: YES)

In [4]:
import mysql.connector
try:
    connection=mysql.connector.connect(
        host='localhost',
        user='root',
        password='root')
    print("Connection successful:",connection)
    connection.close()
except mysql.connector.Error as err:
    print("Error:",err)

Error: 1045 (28000): Access denied for user 'root'@'localhost' (using password: YES)

In [5]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953')
print(connection)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001601A912FA0>

In [6]:
import mysql.connector
try:
    connection=mysql.connector.connect(
        host='localhost',
        user='root',
        password='Balaji@9953')
    print("Connection successful:",connection)
    connection.close()
except mysql.connector.Error as err:
    print("Error:",err)

Connection successful: <mysql.connector.connection_cext.CMySQLConnection object at 0x000001601AA8E970>

In [ ]:
Creating a cursor object
The cursor object can be defined as an abstraction specified in the Python DB-API 2.0. 
It facilitates us to have multiple separate working environments through the same connection to the database. 
We can create the cursor object by calling the 'cursor' function of the connection object. 
The cursor object is an important aspect of executing queries to the databases.
The syntax to create the cursor object is given below.
<my_cur>  = conn.cursor()

In [7]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database="My Database")
cursor=connection.cursor()
print("Connected to the DataBase")

Connected to the DataBase

In [ ]:
Because here no database was created

In [ ]:
Now We can create Database by using the CRUD(create,read,update,delete) operations.

In [8]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database="My DataBase")
cursor=connection.cursor()
print("Connected to the DataBase")

Connected to the DataBase

In [9]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database="MyDB")
cursor=connection.cursor()
print("Connected to the DataBase")

Connected to the DataBase

In [10]:
print(cursor)

CMySQLCursor: (Nothing executed yet)

In [ ]:
Lets go through with step by step

In [ ]:
Creating the Databases
Getting the list of existing databases
We can get the list of all the databases by using the following MySQL query.

>  show databases;

In [11]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953')
cursor=connection.cursor()
try:
    cursor.execute("CREATE DATABASE PythonDB")
    dbs=cursor.execute('show databses')
except:
    connection.rollback()

In [ ]:
check once PythonDB was executed or not.

In [12]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
print(connection)
cursor=connection.cursor()
print("Connected to the Database")
print(cursor)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001601B389AC0>
Connected to the Database
CMySQLCursor: (Nothing executed yet)

In [ ]:
this is the way to create the Database

In [ ]:
Creating the table

In [ ]:
We can create the new table by using the CREATE TABLE statement of SQL. 
In our database PythonDB, the table Employee will have the four columns, i.e., name, id, salary, and department_id initially.

The following query is used to create the new table Employee.

>  create table Employee (name varchar(20) not null, id int primary key, salary float not null, Dept_Id int not null)

In [22]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    dbs=cursor.execute("create table Employee(name Varchar(20) not null,id int(20) not null primary key,salary float not null,Dept_id int not null)")
except:
    connection.rollback()
connection.close()

In [ ]:
Table was created

In [23]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    dbs=cursor.execute("DESCRIBE Employee")
    for row in cursor.fetchall():
        display(row)
except mysql.connector.Error as err:
    print(f"Error: {err}")
connection.close()

('name', b'varchar(20)', 'NO', '', None, '')

('id', b'int', 'NO', 'PRI', None, '')

('salary', b'float', 'NO', '', None, '')

('Dept_id', b'int', 'NO', '', None, '')

In [ ]:
These way we are creating the tables. Lets go through the ALTER the Table

Alter Table
Sometimes, we may forget to create some columns, or we may need to update the table schema. 
The alter statement used to alter the table schema if required. Here, we will add the column branch_name to the table Employee. 
The following SQL query is used for this purpose.

alter table Employee add branch_name varchar(20) not null

In [24]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("alter table Employee add Age int not null")
except:
    connection.rollback()
connection.close()

In [ ]:
Now Age is added on the Employee Table

In [26]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("DESCRIBE Employee")
    for row in cursor.fetchall():
        display(row)
except:
    connection.rollback()
connection.close()

('name', b'varchar(20)', 'NO', '', None, '')

('id', b'int', 'NO', 'PRI', None, '')

('salary', b'float', 'NO', '', None, '')

('Dept_id', b'int', 'NO', '', None, '')

('Age', b'int', 'NO', '', None, '')

In [ ]:
Insert Operation
Adding a record to the table
The INSERT INTO statement is used to add a record to the table. In python, we can mention the format specifier (%s) in place of values.

We provide the actual values in the form of tuple in the execute() method of the cursor.

Consider the following example.

In [41]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
sql="insert into Employee(name,id,salary,Dept_id,Age)values(%s,%s,%s,%s,%s)"
val=("Sai Balaji",101,15000.50,200,21)
try:
    cursor.execute(sql,val)
    connection.commit()
except:
    connection.rollback()
print(cursor.rowcount,"Rows Inserted")
connection.close()

1 Rows Inserted

In [43]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("SELECT * FROM Employee")
    rows=cursor.fetchall()
    for row in rows:
        print(row)
except mysql.connector.Error as err:
    print(f"Error: {err}")
connection.close()

('Sai Balaji', 101, 15000.5, 200, 21)

In [ ]:
Insert multiple rows
We can also insert multiple rows at once using the python script. The multiple rows are mentioned as the list of various tuples.

Each element of the list is treated as one particular row, whereas each element of the tuple is treated as one particular column value (attribute).
to insert multiple rows into the Employee table using the execute() method. 
The execute() method is designed to execute a single query with one set of parameters.
To insert multiple rows, you should use the executemany() method, which allows you to pass a list of tuples for bulk inserts.

In [45]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
sql="insert into Employee(name,id,salary,Dept_id,Age)values(%s,%s,%s,%s,%s)"
val=[('Sai Balaji',102,14000,201,22),('chaithanya',103,13000,202,20),('upendra',104,12000,203,23)]
try:
    cursor.executemany(sql,val)
    connection.commit()
except:
    connection.rollback()
print(cursor.rowcount,"rows inserted")
connection.close()

3 rows inserted

In [47]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("SELECT * FROM Employee")
    for row in cursor.fetchall():
        print(row)
except mysql.connector.Error as err:
    print(f"Error: {error}")
connection.close()

('Sai Balaji', 101, 15000.5, 200, 21)
('Sai Balaji', 102, 14000.0, 201, 22)
('chaithanya', 103, 13000.0, 202, 20)
('upendra', 104, 12000.0, 203, 23)

In [ ]:
Row ID
In SQL, a particular row is represented by an insertion id which is known as row id. 
We can get the last inserted row id by using the attribute lastrowid of the cursor object.

In [48]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
sql="insert into Employee(name,id,salary,Dept_id,Age)values(%s,%s,%s,%s,%s)"
val=('mi',100,20000,199,22)
try:
    cursor.execute(sql,val)
    connection.commit()
except:
    connection.rollback()
print(cursor.rowcount,"rows Inserted! id:",cursor.lastrowid)
connection.close()

1 rows Inserted! id: 0

In [49]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("SELECT * FROM Employee")
    for row in cursor.fetchall():
        print(row)
except mysql.connector.Error as err:
    print(f"Error: {error}")
connection.close()

('mi', 100, 20000.0, 199, 22)
('Sai Balaji', 101, 15000.5, 200, 21)
('Sai Balaji', 102, 14000.0, 201, 22)
('chaithanya', 103, 13000.0, 202, 20)
('upendra', 104, 12000.0, 203, 23)

In [ ]:
Read Operation
The SELECT statement is used to read the values from the databases. We can restrict the output of a select query by using various 
clause in SQL like where, limit, etc.

Python provides the fetchall() method returns the data stored inside the table in the form of rows. 
We can iterate the result to get the individual rows.

In this section of the tutorial, we will extract the data from the database by using the python script. 
We will also format the output to print it on the console.

In [50]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("SELECT * FROM Employee")
    for row in cursor.fetchall():
        print(row)
except mysql.connector.Error as err:
    print(f"Error: {error}")
connection.close()

('mi', 100, 20000.0, 199, 22)
('Sai Balaji', 101, 15000.5, 200, 21)
('Sai Balaji', 102, 14000.0, 201, 22)
('chaithanya', 103, 13000.0, 202, 20)
('upendra', 104, 12000.0, 203, 23)

In [ ]:
Reading specific columns
We can read the specific columns by mentioning their names instead of using star (*).

In the following example, we will read the name, id, and salary from the Employee table and print it on the console.

In [53]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("SELECT name,id,salary FROM Employee")
    for row in cursor.fetchall():
        print(row)
except mysql.connector.Error as err:
    print(f"Error: {err}")
connection.close()

('mi', 100, 20000.0)
('Sai Balaji', 101, 15000.5)
('Sai Balaji', 102, 14000.0)
('chaithanya', 103, 13000.0)
('upendra', 104, 12000.0)

In [ ]:
The fetchone() method
The fetchone() method is used to fetch only one row from the table. The fetchone() method returns the next row of the result-set.

In [55]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("SELECT name,id FROM Employee")
    result=cursor.fetchone()
    print(result)
except mysql.connector.Error as err:
    print(f"Error: {err}")
connection.close()

('mi', 100)

In [ ]:
Formatting the result
We can format the result by iterating over the result produced by the fetchall() or fetchone() method of cursor 
object since the result exists as the tuple object which is not readable.

Consider the following example.

In [58]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("SELECT name,id,salary FROM Employee")
    result=cursor.fetchall()
    print("Name         id    Salary")
    for row in result:
        print("%s       %d    %d"%(row[0],row[1],row[2]))
except:
    connection.rollback()
connection.close()

Name         id    Salary
mi       100    20000
Sai Balaji       101    15000
Sai Balaji       102    14000
chaithanya       103    13000
upendra       104    12000

In [ ]:
Using where clause
We can restrict the result produced by the select statement by using the where clause. 
This will extract only those columns which satisfy the where condition.

In [59]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("SELECT name,id,Age FROM Employee where name like 'S%'")
    result=cursor.fetchall()
    print(result)
except:
    connection.rollback()
connection.close()

[('Sai Balaji', 101, 21), ('Sai Balaji', 102, 22)]

In [61]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("SELECT name,id,Age FROM Employee where name like 'S%'")
    result=cursor.fetchall()
    print("Name        id        salary")
    for row in result:
        print("%s      %d      %d"%(row[0],row[1],row[2]))
except:
    connection.rollback()
connection.close()

Name        id        salary
Sai Balaji      101      21
Sai Balaji      102      22

In [62]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("SELECT name,id,Age FROM Employee where id in (100,101,102)")
    result=cursor.fetchall()
    print(result)
except:
    connection.rollback()
connection.close()

[('mi', 100, 22), ('Sai Balaji', 101, 21), ('Sai Balaji', 102, 22)]

In [ ]:
Ordering the result
The ORDER BY clause is used to order the result.

In [63]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("SELECT name,id,Age FROM Employee order by name")
    result=cursor.fetchall()
    print(result)
except:
    connection.rollback()
connection.close()

[('chaithanya', 103, 20), ('mi', 100, 22), ('Sai Balaji', 101, 21), ('Sai Balaji', 102, 22), ('upendra', 104, 23)]

In [ ]:
Order by DESC
This orders the result in the decreasing order of a particular column.

In [64]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database="PythonDB")
cursor=connection.cursor()
try:
    cursor.execute("SELECT name,id,Age From Employee order by name desc")
    result=cursor.fetchall()
    print(result)
except:
    connection.rollback()
connection.close()

[('upendra', 104, 23), ('Sai Balaji', 101, 21), ('Sai Balaji', 102, 22), ('mi', 100, 22), ('chaithanya', 103, 20)]

In [ ]:
Update Operation
The UPDATE-SET statement is used to update any column inside the table. The following SQL query is used to update a column.

>  update Employee set name = 'alex' where id = 110

In [9]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database="PythonDB")
cursor=connection.cursor()
try:
    cursor.execute("update Employee set name='balaji' where id=102")
    connection.commit()
    cursor.execute('SELECT * FROM Employee')
    result=cursor.fetchall()
    for row in result:
        print(row)
except:
    connection.rollback()
connection.close()

('mi', 100, 20000.0, 199, 22)
('Sai Balaji', 101, 15000.5, 200, 21)
('balaji', 102, 14000.0, 201, 22)
('chaithanya', 103, 13000.0, 202, 20)
('upendra', 104, 12000.0, 203, 23)

In [ ]:
Delete Operation
The DELETE FROM statement is used to delete a specific record from the table. 
Here, we must impose a condition using WHERE clause otherwise all the records from the table will be removed.

The following SQL query is used to delete the employee detail whose id is 110 from the table.
>  delete from Employee where id = 110

In [16]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("delete FROM Employee where id=102")
    connection.commit()
    cursor.execute("SELECT * FROM Employee")
    result=cursor.fetchall()
    for row in result:
        print(row)
except:
    connection.rollback()
connection.close()

('mi', 100, 20000.0, 199, 22)
('Sai Balaji', 101, 15000.5, 200, 21)
('chaithanya', 103, 13000.0, 202, 20)
('upendra', 104, 12000.0, 203, 23)

In [ ]:
Join Operation
We can combine the columns from two or more tables by using some common column among them by using the join statement.
We have only one table in our database, let's create one more table Departments with two columns department_id and department_name.
create table Departments (Dept_id int(20) primary key not null, Dept_Name varchar(20) not null);

In [12]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("create table Departments (Dept_id int(20) primary key not null, Dept_Name varchar(20) not null)")
    connection.commit()
except:
    connection.rollback()
connection.close()

In [13]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute('DESCRIBE Departments')
    for row in cursor.fetchall():
        print(row)
except mysql.connector.Error as err:
    print(f"Error: {err}")
connection.close()

('Dept_id', b'int', 'NO', 'PRI', None, '')
('Dept_Name', b'varchar(20)', 'NO', '', None, '')

In [15]:
import mysql.connector

connection = mysql.connector.connect(
    host='localhost',
    user='root',
    passwd='Balaji@9953',
    database='PythonDB'
)
cursor = connection.cursor()

sql = "INSERT INTO Departments (Dept_id, Dept_Name) VALUES (%s, %s)"
val = [(199, 'CSE'), (200, 'CSE'), (202, 'ECE'), (203, 'EEE')]

try:
    cursor.executemany(sql, val)
    connection.commit()
    print(cursor.rowcount, "rows inserted")
except mysql.connector.Error as e:
    connection.rollback()
    print("Error:", e)
connection.close()

4 rows inserted

In [16]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("SELECT * FROM Departments")
    for row in cursor.fetchall():
        print(row)
except:
    connection.rollback()
connection.close()

(199, 'CSE')
(200, 'CSE')
(202, 'ECE')
(203, 'EEE')

In [17]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("SELECT * FROM Employee")
    for row in cursor.fetchall():
        print(row)
except:
    connection.rollback()
connection.close()

('mi', 100, 20000.0, 199, 22)
('Sai Balaji', 101, 15000.5, 200, 21)
('chaithanya', 103, 13000.0, 202, 20)
('upendra', 104, 12000.0, 203, 23)

In [24]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    result=cursor.execute("select Employee.name,Employee.id,Employee.salary,Employee.Age,Departments.Dept_id,Departments.Dept_Name from Departments left join Employee on Departments.Dept_id=Employee.Dept_id")
    print("Name             ID              Salary           Age           Dept_Id    Dept_Name")  
    for row in cursor:
        print(row[0],"          ", row[1],"       ",row[2],"          ",row[3],"            ",row[4],"            ",row[5])
except:
    connection.rollback()
connection.close()

Name             ID              Salary           Age           Dept_Id    Dept_Name
mi            100         20000.0            22              199              CSE
Sai Balaji            101         15000.5            21              200              CSE
chaithanya            103         13000.0            20              202              ECE
upendra            104         12000.0            23              203              EEE

In [ ]:
Right Join

Right join shows all the columns of the right-hand side table as we have two tables in the database PythonDB, i.e., 
Departments and Employee. We do not have any Employee in the table who is not working for any department (Employee for which department id is null).

In [31]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
sql="insert into Employee(name,id,salary,Dept_id,Age)values(%s,%s,%s,%s,%s)"
values=('hi',105,10000.0,0,18)
try:
    cursor.execute(sql, values)
    connection.commit()
    print(cursor.rowcount, "rows inserted")
except mysql.connector.Error as e:
    connection.rollback()
    print("Error:", e)
connection.close()

1 rows inserted

In [32]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute("SELECT * FROM Employee")
    for row in cursor.fetchall():
        print(row)
except:
    connection.rollback()
connection.close()

('mi', 100, 20000.0, 199, 22)
('Sai Balaji', 101, 15000.5, 200, 21)
('chaithanya', 103, 13000.0, 202, 20)
('upendra', 104, 12000.0, 203, 23)
('hi', 105, 10000.0, 0, 18)

In [33]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    result=cursor.execute("select Employee.name,Employee.id,Employee.salary,Employee.Age,Departments.Dept_id,Departments.Dept_Name from Departments right join Employee on Departments.Dept_id=Employee.Dept_id")
    print("Name             ID              Salary           Age           Dept_Id    Dept_Name")  
    for row in cursor:
        print(row[0],"          ", row[1],"       ",row[2],"          ",row[3],"            ",row[4],"            ",row[5])
except:
    connection.rollback()
connection.close()

Name             ID              Salary           Age           Dept_Id    Dept_Name
mi            100         20000.0            22              199              CSE
Sai Balaji            101         15000.5            21              200              CSE
chaithanya            103         13000.0            20              202              ECE
upendra            104         12000.0            23              203              EEE
hi            105         10000.0            18              None              None

In [ ]:
Left Join
The left join covers all the data from the left-hand side table.

In [34]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    result=cursor.execute("select Employee.name,Employee.id,Employee.salary,Employee.Age,Departments.Dept_id,Departments.Dept_Name from Departments left join Employee on Departments.Dept_id=Employee.Dept_id")
    print("Name             ID              Salary           Age           Dept_Id    Dept_Name")  
    for row in cursor:
        print(row[0],"          ", row[1],"       ",row[2],"          ",row[3],"            ",row[4],"            ",row[5])
except:
    connection.rollback()
connection.close()

Name             ID              Salary           Age           Dept_Id    Dept_Name
mi            100         20000.0            22              199              CSE
Sai Balaji            101         15000.5            21              200              CSE
chaithanya            103         13000.0            20              202              ECE
upendra            104         12000.0            23              203              EEE

In [ ]:
Performing Transactions

Performing Transactions
Transactions ensure the data consistency of the database. We have to make sure that more than one applications must not modify the 
records while performing the database operations. The transactions have the following properties.

Atomicity
Either the transaction completes, or nothing happens. If a transaction contains 4 queries then all these queries must be executed, 
or none of them must be executed.
    
Consistency
The database must be consistent before the transaction starts and the database must also be consistent after the transaction is completed.

Isolation
Intermediate results of a transaction are not visible outside the current transaction.

Durability
Once a transaction was committed, the effects are persistent, even after a system failure.

In [7]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute('delete from Employee where id=103')
    connection.commit()
    print("row was deleted")
except Error as err:
    print("can't delete")
    connection.rollback

row was deleted

In [9]:
import mysql.connector
connection=mysql.connector.connect(host='localhost',user='root',passwd='Balaji@9953',database='PythonDB')
cursor=connection.cursor()
try:
    cursor.execute('SELECT Employee.name,Employee.id,Employee.salary,Employee.Age,Departments.Dept_Id,Departments.Dept_Name FROM Departments left join Employee on Departments.Dept_Id=Employee.Dept_id')
    result=cursor.fetchall()
    for row in result:
        print(row)
except:
    connection.rollback()
connection.close()

('mi', 100, 20000.0, 22, 199, 'CSE')
('Sai Balaji', 101, 15000.5, 21, 200, 'CSE')
(None, None, None, None, 202, 'ECE')
('upendra', 104, 12000.0, 23, 203, 'EEE')